blog/drafts/logic-programming-python-simple.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-27 Mon 15:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Logic Programming in Python</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Logic Programming in Python</h1>
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/MNoorFawi/logic-programming-in-python">this website</a> has a few examples that use <code>kanren</code>'s ancestors, <code>logpy</code>. Issue raised according to which examples did not run, so I'm translating them here.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> run, var
<span style="font-weight: bold;">from</span> kanren.facts <span style="font-weight: bold;">import</span> facts, Relation

<span style="font-weight: bold; font-style: italic;">food_type</span> = Relation()
<span style="font-weight: bold; font-style: italic;">flavor</span> = Relation()

facts(food_type, (<span style="font-style: italic;">"gouda"</span>, <span style="font-style: italic;">"cheese"</span>), <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">facts</span>
                 (<span style="font-style: italic;">"ritz"</span>, <span style="font-style: italic;">"cracker"</span>),
                 (<span style="font-style: italic;">"steak"</span>, <span style="font-style: italic;">"meat"</span>),
                 (<span style="font-style: italic;">"sausage"</span>, <span style="font-style: italic;">"meat"</span>),
                 (<span style="font-style: italic;">"limonade"</span>, <span style="font-style: italic;">"juice"</span>),
                 (<span style="font-style: italic;">"cookie"</span>, <span style="font-style: italic;">"dessert"</span>))

facts(flavor, (<span style="font-style: italic;">"sweet"</span>, <span style="font-style: italic;">"dessert"</span>),
              (<span style="font-style: italic;">"savory"</span>, <span style="font-style: italic;">"meat"</span>),
              (<span style="font-style: italic;">"savory"</span>, <span style="font-style: italic;">"cheese"</span>),
              (<span style="font-style: italic;">"sweet"</span>, <span style="font-style: italic;">"juice"</span>))

<span style="font-weight: bold; font-style: italic;">food_flavor</span>, <span style="font-weight: bold; font-style: italic;">food_v</span>, <span style="font-weight: bold; font-style: italic;">flavor_v</span> = var(), var(), var() <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">define the variables to use in the search</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">We're looking for the food and flavor st</span>
<span style="font-weight: bold; font-style: italic;">res</span> = run(0, food_flavor, food_type(food_flavor, food_v), flavor(<span style="font-style: italic;">"sweet"</span>, food_v))

<span style="font-weight: bold;">print</span>(res)
</pre>
</div>

<pre class="example">
('limonade', 'cookie')
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> conde


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">food_flavor</span>(x, y):
    <span style="font-weight: bold; font-style: italic;">z</span> = var()
    <span style="font-weight: bold;">return</span> conde((food_type(x, z), flavor(y, z)))

<span style="font-weight: bold; font-style: italic;">what</span> = var()
<span style="font-weight: bold;">print</span>(run(0, what, food_flavor(what, <span style="font-style: italic;">"sweet"</span>)))
<span style="font-weight: bold;">print</span>(run(0, what, food_flavor(what, <span style="font-style: italic;">"savory"</span>)))
</pre>
</div>

<pre class="example">
('limonade', 'cookie')
('steak', 'gouda', 'sausage')
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">likes</span> = Relation()
facts(likes,
      (<span style="font-style: italic;">"Noor"</span>, <span style="font-style: italic;">"sausage"</span>),
      (<span style="font-style: italic;">"Melissa"</span>, <span style="font-style: italic;">"pasta"</span>),
      (<span style="font-style: italic;">"Dmitry"</span>, <span style="font-style: italic;">"cookie"</span>),
      (<span style="font-style: italic;">"Nikita"</span>, <span style="font-style: italic;">"sausage"</span>),
      (<span style="font-style: italic;">"Assel"</span>, <span style="font-style: italic;">"limonade"</span>)
)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">friend</span>(x, y):
    <span style="font-weight: bold; font-style: italic;">z</span> = var()
    <span style="font-weight: bold;">return</span> conde((likes(x, z), likes(y, z)))

<span style="font-weight: bold; font-style: italic;">who</span> = var()
<span style="font-weight: bold; font-style: italic;">name</span> = <span style="font-style: italic;">"Noor"</span>
<span style="font-weight: bold; font-style: italic;">output</span> = run(0, who, friend(who, name))
<span style="font-weight: bold;">print</span>([x <span style="font-weight: bold;">for</span> x <span style="font-weight: bold;">in</span> output <span style="font-weight: bold;">if</span> x != name])
</pre>
</div>

<pre class="example">
['Nikita']
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> lall


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dish_to_like</span>(person, what):
    <span style="font-weight: bold; font-style: italic;">liked</span> = var()
    <span style="font-weight: bold; font-style: italic;">foodtype</span> = var()
    <span style="font-weight: bold; font-style: italic;">foodflavor</span> = var()
    <span style="font-weight: bold;">return</span> lall(
        likes(person, liked),
        food_type(liked, foodtype),
        flavor(foodflavor, foodtype),
        food_flavor(what, foodflavor)
    )

<span style="font-weight: bold; font-style: italic;">what</span> = var()
<span style="font-weight: bold; font-style: italic;">dish</span> = run(0, what, dish_to_like(<span style="font-style: italic;">"Noor"</span>, what))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"since Noor has liked Sausage, he would like:"</span>, dish)
</pre>
</div>

<pre class="example">
since Noor has liked Sausage, he would like: ('steak', 'gouda', 'sausage')
</pre>

<div id="outline-container-org9d85f24" class="outline-2">
<h2 id="org9d85f24">The Zebra riddle</h2>
<div class="outline-text-2" id="text-org9d85f24">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> kanren <span style="font-weight: bold;">import</span> eq, <span style="font-weight: bold;">vars</span>

<span style="font-weight: bold; font-style: italic;">houses</span> = var()
<span style="font-weight: bold; font-style: italic;">five_houses</span> = eq(<span style="font-weight: bold;">vars</span>(5), houses)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Each house has the following characteristics:</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- Nationality of occupant</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- Drink type</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- Animal</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- Cigarettes</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- Color of the house</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">- It has an order</span>

</pre>
</div>
</div>
</div>
</div>
</body>
</html>
